## [ DataFrame 행/열 추가 ]

(1) 모듈 로딩 
---

In [1]:
import pandas as pd

(2) 데이터 준비 
---

In [2]:
# dict 타입의 데이터 생성
exam={ '이름':['마징가', '베트맨', '홍길동', '임꺽정'],
      '국어':[98, 79, 99, 100],
      '미술':[70, 99, 87, 80],
      '수학':[46, 85, 89, 60],
      '체육':[80, 88, 75, 100]}

(3) DataFrame에 데이터 저장
---

In [3]:
examDF=pd.DataFrame(exam)

In [4]:
examDF

    이름   국어  미술  수학   체육
0  마징가   98  70  46   80
1  베트맨   79  99  85   88
2  홍길동   99  87  89   75
3  임꺽정  100  80  60  100

(4) 저장된 데이터 속성 확인 <hr>

In [11]:
def printAttribute(df, dfname):
    print(f'[(dfname)]')
    print(f'index\n   ===> {examDF.index}')
    print(f'columns\n   ===> {examDF.columns}')
    print(f'shape\n   ===> {examDF.shape}')
    print(f'ndim\n   ===> {examDF.ndim}')
    print(f'size\n   ===> {examDF.size}')
    print(f'dtypes\n   ===> {examDF.dtypes}')

In [12]:
printAttribute(examDF, 'examDF')

[(dfname)]
index
   ===> RangeIndex(start=0, stop=4, step=1)
columns
   ===> Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')
shape
   ===> (4, 5)
ndim
   ===> 2
size
   ===> 20
dtypes
   ===> 이름    object
국어     int64
미술     int64
수학     int64
체육     int64
dtype: object

In [13]:
examDF.dtypes

이름    object
국어     int64
미술     int64
수학     int64
체육     int64
dtype: object

#### (5) DataFrame에 컬럼(column) 추가 <hr>
- 방법 : DF객체변수명[새로운컬럼명] = 값

In [14]:
examDF.columns

Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')

In [21]:
# 행 갯수 만큼 값 추가
examDF['영어']=[90, 89, 100, 99]

In [22]:
examDF

    이름   국어  미술  수학   체육   영어  과학
0  마징가   98  70  46   80   90  10
1  베트맨   79  99  85   88   89  10
2  홍길동   99  87  89   75  100  10
3  임꺽정  100  80  60  100   99  10

In [24]:
# 1개의 데이터 즉 값 추가 시 모든 행에 동일 값으로 저장
examDF['과학']=10      # 다 같은 값으로 들어가게된다.

In [20]:
examDF

    이름   국어  미술  수학   체육   영어  과학
0  마징가   98  70  46   80   90  10
1  베트맨   79  99  85   88   89  10
2  홍길동   99  87  89   75  100  10
3  임꺽정  100  80  60  100   99  10

In [26]:
#examDF['컴퓨터']=[89, 10]   # 갯수 다른 리스트로는 안된다.

In [28]:
examDF[6]=0
examDF                        # 숫자 column가능

    이름   국어  미술  수학   체육   영어  과학  6
0  마징가   98  70  46   80   90  10  0
1  베트맨   79  99  85   88   89  10  0
2  홍길동   99  87  89   75  100  10  0
3  임꺽정  100  80  60  100   99  10  0

(6) DataFrame에 행(row) 추가 <hr>
- 방법 : DF객체변수명.loc[새로운 행인덱스] = [ 컬럼수 만큼 데이터]
- 방법 : DF객체변수명.loc[새로운 행인덱스] = 데이터
- 불가 방법 : DF객체변수명.iloc[새로운 행인덱스] = 데이터 => 데이터 존재해야지 인덱스 할당됨

In [29]:
examDF.index

RangeIndex(start=0, stop=4, step=1)

In [39]:
# 컬럼 수 만큼의 데이터를 가진 행 추가
examDF.loc[4]=['원더우먼',90,89,77,20,79,21,87]

In [40]:
examDF

     이름   국어  미술  수학   체육   영어  과학   6
0   마징가   98  70  46   80   90  10   0
1   베트맨   79  99  85   88   89  10   0
2   홍길동   99  87  89   75  100  10   0
3   임꺽정  100  80  60  100   99  10   0
4  원더우먼   90  89  77   20   79  21  87
5   슈퍼맨   90  89  77   20   79  21  87

In [41]:
# 행 추가시 iloc는 사용불가 => Why? 데이터 수에 맞게 인덱스 범위 지정이 되기때문에
# 현재 인덱스에 없는 인덱스로 불가
examDF.iloc[5]=['슈퍼맨',90,89,77,20,79,21,87]

In [42]:
examDF

     이름   국어  미술  수학   체육   영어  과학   6
0   마징가   98  70  46   80   90  10   0
1   베트맨   79  99  85   88   89  10   0
2   홍길동   99  87  89   75  100  10   0
3   임꺽정  100  80  60  100   99  10   0
4  원더우먼   90  89  77   20   79  21  87
5   슈퍼맨   90  89  77   20   79  21  87

In [45]:
# 1개 데이터가진 행 추가
examDF.iloc[5]='슈퍼맨'

In [46]:
examDF

     이름   국어   미술   수학   체육   영어   과학    6
0   마징가   98   70   46   80   90   10    0
1   베트맨   79   99   85   88   89   10    0
2   홍길동   99   87   89   75  100   10    0
3   임꺽정  100   80   60  100   99   10    0
4  원더우먼   90   89   77   20   79   21   87
5   슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨